# какая строка получилась
# s = '1' * 111
# while '11111' in s :
#     s = s.replace('111','2',1)
#     s = s.replace('222','3',1)
#     s = s.replace('333','1',1)
# print(s)


#Сколько удалено двоек
# s = '2' * 400
# ans = 0
# while '222' in s or '333' in s:
#     if '333' in s :
#         s = s.replace('333', '2', 1)
#     else:
#         s = s.replace('222', '3', 1)
#         ans += 3
# print(ans)
# print(s)



# считаем сумму цифр
# n = int(s)
# ans = 0
# while n > 0:
#     ans += n % 10
#     n //= 10
# print(ans)

# ans = 0
# for i in s:
#     ans += int(i)
# print(ans)

# print(sum([int(i) for i in s]))
# print(sum(map(int, s)))




# ПОКА нашлось(01) ИǾИ нашлось(02) ИǾИ нашлось(03)
# заменить(01, 30)
# заменить(02, 3103)
# заменить(03, 1201)
# КОНЕЦ ПОКА

# # Известно, что исходная строка начиналась с нуля, а далее содержала только единицы,
# # двойки и тройки. Ȃосле выполнения данной программы получилась строка,
# # содержащая 31 единицу, 24 двойки и 46 троек. Сколько троек было в исходной строке?
# for n1 in range(20):
#     for n2 in range(20):
#         for n3 in range(20):
#             s = '0' + '1' * n1 + '2' * n2 + '3' * n3
#             while '01' in s or '02' in s or '03' in s:
#                 s = s.replace('01', '30', 1)
#                 s = s.replace('02', '3103', 1)
#                 s = s.replace('03', '1201', 1)
#             if s.count('1') == 31 and s.count('2') == 24 and s.count('3') == 46:
#                 print(n3)
#                 exit(0)
# #17


# ПОКА нашлось (>1) ИЛИ нашлось (>2) ИЛИ нашлось (>3)
#    заменить (>1, 2>3)
#    заменить (>2, 33>)
#    заменить (>3, 1>22)
# КОНЕЦ ПОКА
# На вход приведённой ниже программе поступает строка,
# начинающаяся с символа «>», а затем содержащая 30 цифр 1,
# 20 цифр 2 и 10 цифр 3, расположенных в произвольном порядке.

# Определите сумму числовых значений цифр строки

# s = '>' + '1' * 30 + '2' * 20 + '3' * 10
# while '>1' in s or '>2' in s or '>3' in s:
#     s = s.replace('>1' , '2>3', 1)
#     s = s.replace('>2', '33>', 1)
#     s = s.replace('>3', '1>22', 1)
# s = s.replace('>', '')
# print(sum(map(int, s)))
# print(sum([int(i) for i in s if i != '>']))
#700

# for n1 in range(20):
#     for n2 in range(20):
#         for n3 in range(20):
#             s = '0' + '1'*n1 + '2' * n2 + '3' * n3
#             while '01' in s or '02' in s or '03' in s:
#                 s = s.replace('01', '210', 1)
#                 s = s.replace('02', '3101', 1)
#                 s = s.replace('03', '2302', 1)
#             if s.count('1') == 52 and s.count('2') == 33 and s.count('3') == 23:
#                 print(n2)
#                 exit(0)
